In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("office_supplies.csv")

In [10]:
pd.set_option("display.max_columns", df.shape[0])
df.head()

   OrderDate   Region      Rep     Item  Units  Unit Price
0  04-Jul-14     East  Richard  Pen Set     62        4.99
1  12-Jul-14     East     Nick   Binder     29        1.99
2  21-Jul-14  Central   Morgan  Pen Set     55       12.49
3  29-Jul-14     East    Susan   Binder     81       19.99
4  07-Aug-14  Central  Matthew  Pen Set     42       23.95

In [13]:
group = df.groupby("Region")

In [14]:
group.mean()

             Units  Unit Price
Region
Central  49.958333   18.018750
East     53.153846    9.143846
West     38.500000   53.658333

In [16]:
df.shape

(43, 6)

In [22]:
import random
arbitrary_group = [random.randint(0,1) for _ in range(43)]
group2 = df.groupby(arbitrary_group)
group2.mean()

       Units  Unit Price
0  45.360000   22.419200
1  54.833333   17.377222

In [27]:
group3 = df.groupby(["Region","Rep"])
group3.sum()

                 Units  Unit Price
Region  Rep
Central Alex       281       39.95
        Bill       213       40.55
        Matthew    193      173.93
        Morgan     173       26.47
        Rachel     183       10.26
        Smith      156      141.29
East    Nick       125        6.98
        Richard    396       55.92
        Susan      170       55.97
West    James      142      299.97
        Thomas      89       21.98

In [31]:
new_df = df.groupby(['Region','Rep'])['Units'].count()
new_df.reset_index()

     Region      Rep  Units
0   Central     Alex      5
1   Central     Bill      5
2   Central  Matthew      4
3   Central   Morgan      3
4   Central   Rachel      4
5   Central    Smith      3
6      East     Nick      2
7      East  Richard      8
8      East    Susan      3
9      West    James      4
10     West   Thomas      2

In [33]:
for c in group3.groups:
    print c

('Central', 'Smith')
('West', 'Thomas')
('Central', 'Alex')
('Central', 'Matthew')
('West', 'James')
('East', 'Richard')
('East', 'Susan')
('East', 'Nick')
('Central', 'Morgan')
('Central', 'Bill')
('Central', 'Rachel')

In [34]:
group3.size()

Region   Rep
Central  Alex       5
         Bill       5
         Matthew    4
         Morgan     3
         Rachel     4
         Smith      3
East     Nick       2
         Richard    8
         Susan      3
West     James      4
         Thomas     2
dtype: int64

In [44]:
g1 = df.groupby('Region')
print("Sales by region")
print(g1['Units'].count())
print("\nUnits by region")
print(g1['Units'].sum())
print("\nTotal value by region")
print(g1['Unit Price'].sum())

Sales by region
Region
Central    24
East       13
West        6
Name: Units, dtype: int64

Units by region
Region
Central    1199
East        691
West        231
Name: Units, dtype: int64

Total value by region
Region
Central    432.45
East       118.87
West       321.95
Name: Unit Price, dtype: float64

In [48]:
g2 = df.groupby(['Rep','Region'])
print("Units sold for each region by rep")
print(g2['Units'].count())

Units sold for each region by rep
Rep      Region
Alex     Central    5
Bill     Central    5
James    West       4
Matthew  Central    4
Morgan   Central    3
Nick     East       2
Rachel   Central    4
Richard  East       8
Smith    Central    3
Susan    East       3
Thomas   West       2
Name: Units, dtype: int64

In [51]:
print("Sales by date")
print(df.groupby("OrderDate")['Units'].count())

Sales by date
OrderDate
01-Apr-15    1
01-Feb-15    1
01-Sep-14    1
04-Dec-14    1
04-Jul-14    1
05-May-15    1
05-Oct-14    1
06-Jan-15    1
07-Aug-14    1
07-Mar-15    1
08-Jun-15    1
08-Nov-14    1
09-Feb-15    1
10-Apr-15    1
10-Sep-14    1
12-Dec-14    1
12-Jul-14    1
14-May-15    1
14-Oct-14    1
15-Aug-14    1
15-Jan-15    1
15-Mar-15    1
17-Jun-15    1
17-Nov-14    1
18-Apr-15    1
18-Feb-15    1
18-Sep-14    1
21-Dec-14    1
21-Jul-14    1
22-May-15    1
22-Oct-14    1
23-Jan-15    1
24-Aug-14    1
24-Mar-15    1
25-Jun-15    1
25-Nov-14    1
26-Feb-15    1
27-Apr-15    1
27-Sep-14    1
29-Dec-14    1
29-Jul-14    1
31-May-15    1
31-Oct-14    1
Name: Units, dtype: int64

In [53]:
df.groupby(["Region","Rep"])['Unit Price'].mean()

Region   Rep
Central  Alex        7.990000
         Bill        8.110000
         Matthew    43.482500
         Morgan      8.823333
         Rachel      2.565000
         Smith      47.096667
East     Nick        3.490000
         Richard     6.990000
         Susan      18.656667
West     James      74.992500
         Thomas     10.990000
Name: Unit Price, dtype: float64

In [61]:
df["OrderDate"] = pd.to_datetime(df["OrderDate"])
print("Order by month")
df.groupby(df["OrderDate"].dt.month)['Units'].count()

Order by month

OrderDate
1     3
2     4
3     3
4     4
5     4
6     3
7     4
8     3
9     4
10    4
11    3
12    4
Name: Units, dtype: int64